@echo off

rem ========================================
rem 初期処理
rem ========================================

rem ------------------------------
rem 変数のローカル化
rem ------------------------------
setlocal
set ret_success=0
set ret_fail=1

rem ------------------------------
rem 実行ディレクトリに移動
rem ------------------------------
pushd "%~dp0"

rem ------------------------------
rem 管理者権限の確認
rem ------------------------------
openfiles >nul 2>&1
if %ERRORLEVEL% neq 0 (
    echo 管理者権限がありません
    echo 管理者として実行しなおしてください
    echo.
    pause
    popd
    exit /b %ret_fail%
)

rem ========================================
rem メインの処理
rem ========================================

powershell -ExecutionPolicy RemoteSigned -File .\changelastuser.ps1
pause

rem ========================================
rem 終了処理
rem ========================================
popd
exit /b %ret_success%
rem ========================================
